In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
from collections import Counter

In [3]:
data = pd.read_csv('movie_bd_v5.csv')
data.sample(5)

,imdb_id,budget,revenue,original_title,cast,director,tagline,overview,runtime,genres,production_companies,release_date,vote_average,release_year
1564,tt0332280,29000000,115603229,The Notebook,Rachel McAdams|Ryan Gosling|Gena Rowlands|Jame...,Nick Cassavetes,Behind every great love is a great story.,An epic love story centered around an older ma...,123,Romance|Drama,New Line Cinema,6/25/2004,7.5,2004
1452,tt0327084,80000000,155019340,Over the Hedge,Bruce Willis|Garry Shandling|Steve Carell|Wand...,Tim Johnson|Karey Kirkpatrick,Taking back the neighborhood... One snack at a...,A scheming raccoon fools a mismatched family o...,83,Comedy|Animation|Family,Pacific Data Images (PDI)|DreamWorks Animation,4/22/2006,6.2,2006
1450,tt0452594,52000000,204999686,The Break-Up,Vince Vaughn|Jennifer Aniston|Joey Lauren Adam...,Peyton Reed,. . . pick a side.,Cohabitating couple Gary and Brooke find their...,106,Romance|Comedy,Universal Pictures|Mosaic Media Group|Wild Wes...,6/1/2006,5.5,2006
1309,tt2167202,18000000,10501938,Getaway,Ethan Hawke|Selena Gomez|Jon Voight|Paul Freem...,Courtney Solomon,Get in. Get out. Getaway.,Former race car driver Brent Magna (Hawke) is ...,90,Action|Crime,Dark Castle Entertainment|Signature Pictures|A...,8/29/2013,5.0,2013
1485,tt0443543,40000000,86915017,The Illusionist,Edward Norton|Jessica Biel|Paul Giamatti|Rufus...,Neil Burger,Nothing Is What It Seems.,"With his eye on a lovely aristocrat, a gifted ...",110,Fantasy|Drama|Thriller|Romance,Michael London Productions|Stillking Films|Bob...,8/18/2006,7.0,2006

In [4]:
data.describe()

             budget       revenue      runtime  vote_average  release_year
count  1.889000e+03  1.889000e+03  1889.000000   1889.000000   1889.000000
mean   5.431083e+07  1.553653e+08   109.658549      6.140762   2007.860773
std    4.858721e+07  2.146698e+08    18.017041      0.764763      4.468841
min    5.000000e+06  2.033165e+06    63.000000      3.300000   2000.000000
25%    2.000000e+07  3.456058e+07    97.000000      5.600000   2004.000000
50%    3.800000e+07  8.361541e+07   107.000000      6.100000   2008.000000
75%    7.200000e+07  1.782626e+08   120.000000      6.600000   2012.000000
max    3.800000e+08  2.781506e+09   214.000000      8.100000   2015.000000

# Предобработка

In [5]:
# создадим словарь для ответов
answers = {} 

# тут другие ваши предобработки колонок например:

#the time given in the dataset is in string format.
#So we need to change this in datetime format
# ...

# 1. У какого фильма из списка самый большой бюджет?

Использовать варианты ответов в коде решения запрещено.    
Вы думаете и в жизни у вас будут варианты ответов?)

In [6]:
# запишите свой вариант ответа
answers['1'] = 'Pirates of the Caribbean: On Stranger Tides (tt1298650)'
# если ответили верно, можете добавить комментарий со значком "+"

In [10]:
# тут пишем ваш код для решения данного вопроса:
data[data['budget'] == data['budget'].max()][['original_title', 'imdb_id']]

                                  original_title    imdb_id
723  Pirates of the Caribbean: On Stranger Tides  tt1298650

ВАРИАНТ 2

In [0]:
# можно добавлять разные варианты решения

# 2. Какой из фильмов самый длительный (в минутах)?

In [7]:
# думаю логику работы с этим словарем вы уже поняли, 
# по этому не буду больше его дублировать
answers['2'] = 'Gods and Generals (tt0279111)'

In [16]:
data[data['runtime'] == data['runtime'].max()][['original_title', 'imdb_id', 'runtime', 'release_date']]

         original_title    imdb_id  runtime release_date
1157  Gods and Generals  tt0279111      214    2/21/2003

# 3. Какой из фильмов самый короткий (в минутах)?

In [8]:
answers['3'] = 'Winnie the Pooh (tt1449283)'

In [22]:
data[data['runtime'] == data['runtime'].min()][['original_title', 'imdb_id', 'runtime', 'release_date']]

      original_title    imdb_id  runtime release_date
768  Winnie the Pooh  tt1449283       63    4/13/2011

# 4. Какова средняя длительность фильмов?

In [9]:
answers['4'] = '110'

In [27]:
data['runtime'].mean()

109.6585494970884

# 5. Каково медианное значение длительности фильмов?

In [10]:
answers['5'] = '107'

In [35]:
data['runtime'].median()

107.0

# 6. Какой самый прибыльный фильм?
#### Внимание! Здесь и далее под «прибылью» или «убытками» понимается разность между сборами и бюджетом фильма. (прибыль = сборы - бюджет) в нашем датасете это будет (profit = revenue - budget)

In [109]:
# лучше код получения столбца profit вынести в Предобработку что в начале
data['profit'] = data['revenue'] - data['budget']
display(data[['profit', 'revenue', 'budget']])

          profit     revenue     budget
0     1363528810  1513528810  150000000
1      228436354   378436354  150000000
2      185238201   295238201  110000000
3     1868178225  2068178225  200000000
4     1316249360  1506249360  190000000
...          ...         ...        ...
1884    82299717   157299717   75000000
1885    -8444012    13555988   22000000
1886   -40865180    35134820   76000000
1887    -3962091    36037909   40000000
1888    -9782502     5217498   15000000

[1889 rows x 3 columns]

In [11]:
answers['6'] = 'Avatar (tt0499549)'

In [40]:
data[data['profit'] == data['profit'].max()][['original_title', 'imdb_id', 'profit', 'release_date']]

    original_title    imdb_id      profit release_date
239         Avatar  tt0499549  2544505847   12/10/2009

# 7. Какой фильм самый убыточный?

In [12]:
answers['7'] = 'The Lone Ranger (tt1210819)'

In [110]:
data[data['profit'] == data['profit'].min()][['original_title', 'imdb_id', 'profit', 'release_date']]

       original_title    imdb_id     profit release_date
1245  The Lone Ranger  tt1210819 -165710090     7/3/2013

# 8. У скольких фильмов из датасета объем сборов оказался выше бюджета?

In [13]:
answers['8'] = '1478'

In [44]:
data[data['revenue'] > data['budget']]['imdb_id'].count()

1478

# 9. Какой фильм оказался самым кассовым в 2008 году?

In [14]:
answers['9'] = 'The Dark Knight (tt0468569)'

In [55]:
answer9 = data[data['release_year'] == 2008]
answer9 = answer9[answer9['revenue'] == answer9['revenue'].max()]
answer9[['original_title', 'imdb_id', 'profit', 'revenue', 'release_date']]

      original_title    imdb_id     profit     revenue release_date
599  The Dark Knight  tt0468569  816921825  1001921825    7/16/2008

# 10. Самый убыточный фильм за период с 2012 по 2014 г. (включительно)?

In [15]:
answers['10'] = 'The Lone Ranger (tt1210819)'

In [57]:
answer10 = data[(data['release_year'] >= 2012)&(data['release_year'] <= 2014)]
answer10 = answer10[answer10['profit'] == answer10['profit'].min()]
answer10[['original_title', 'imdb_id', 'profit', 'revenue', 'release_date']]

       original_title    imdb_id     profit   revenue release_date
1245  The Lone Ranger  tt1210819 -165710090  89289910     7/3/2013

# 11. Какого жанра фильмов больше всего?

In [16]:
answers['11'] = 'Drama'

In [36]:
# эту задачу тоже можно решать разными подходами, попробуй реализовать разные варианты
# если будешь добавлять функцию - выноси ее в предобработку что в начале

def split_data_in_field(column):
    """
    Функция разбивает данные внутри колонки, и возвращает список со всеми значениями
        Параметры:
                    column (DataFrame): данные по колонке
    """
    result = []    
    for elements in column:
        for element in elements.split('|'):
            result.append(element)
    return result
    
genres_list = pd.DataFrame(split_data_in_field(data['genres']))
genres_list.columns = ['genre']
genres_list['length'] =  len(genres_list['genre'])
genres_list.groupby(['genre']).agg('count').sort_values(['length'], ascending=False)

                 length
genre
Drama               782
Comedy              683
Thriller            596
Action              582
Adventure           415
Crime               315
Romance             308
Family              260
Science Fiction     248
Fantasy             222
Horror              176
Mystery             168
Animation           139
Music                64
History              62
War                  58
Western              19
Documentary           8
Foreign               2

ВАРИАНТ 2

In [113]:
genres_list['genre'].describe()

count      5107
unique       19
top       Drama
freq        782
Name: genre, dtype: object

# 12. Фильмы какого жанра чаще всего становятся прибыльными?

In [17]:
answers['12'] = 'Action'
# просьба дать пояснения, в чём я допустил ошибку в этом задании

In [111]:
# Сформируем список всех жанров, которые встречаются в DataFrame
genres = list(set(split_data_in_field(data['genres'])))

# подготовим DataFrame с жанром и суммой сборов по фильмам
result = {
    'genre': genres, 
    'sum_profit': []
}

# для каждого жанра подсчитаем кассовые сборы по фильмам
for genre in genres:
    result['sum_profit'].append(
        
        data[
            data['genres'].str.contains(genre) & 
            data['profit'] > 0
        ]['profit'].sum()
    )

# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['sum_profit'], ascending=False))

              genre   sum_profit
12           Action  37432398131
0         Adventure  35644999379
5            Comedy  28043827353
11            Drama  24210675251
16         Thriller  22610891916
15          Fantasy  21628031891
6            Family  20773473937
17  Science Fiction  19161299428
8         Animation  14749974712
10          Romance  12605054283
18            Crime   8888335904
3           Mystery   6035914606
7            Horror   5309181995
1               War   2872685394
14            Music   2176694055
9           History   1507123110
2           Western    876316136
13      Documentary    130130410
4           Foreign            0

# 13. У какого режиссера самые большие суммарные кассовые сборы?

In [18]:
answers['13'] = 'Peter Jackson'

In [170]:
# Сформируем список всех директоров, которые встречаются в DataFrame
directors = list(set(split_data_in_field(data['director'])))

# подготовим DataFrame с режиссером и суммой сборов по фильмам
result = {
    'director': directors, 
    'sum_profit': []
}

# для каждого режиссера подсчитаем кассовые сборы по фильмам
for director in directors:
    result['sum_profit'].append(data[data['director'].str.contains(director)]['profit'].sum())

# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['sum_profit'], ascending=False))

              director  sum_profit
722      Peter Jackson  5202593685
610        David Yates  3379295625
411  Christopher Nolan  3162548502
251        J.J. Abrams  2839169916
590        Michael Bay  2760938960
..                 ...         ...
430       Jack Sholder   -75171919
103        Peter Hyams   -86956545
128      Ron Underwood   -92896027
207    James L. Brooks   -96289726
721        Walter Hill  -128283462

[997 rows x 2 columns]

# 14. Какой режисер снял больше всего фильмов в стиле Action?

In [19]:
answers['14'] = 'Robert Rodriguez'

In [186]:
# Сформируем список всех директоров, которые встречаются в DataFrame
directors = list(set(split_data_in_field(data['director'])))

# подготовим DataFrame с режиссером и кол-вом фильмов
result = {
    'director': directors, 
    'films_count': []
}

# для каждого режиссера подсчитаем кол-во фильмов в жанре Action
for director in directors:
    result['films_count'].append(
        data[data['genres'].str.contains('Action') 
             & data['director'].str.contains(director)]['runtime'].count()
    )

# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['films_count'], ascending=False))

                director  films_count
405     Robert Rodriguez            9
590          Michael Bay            7
344   Paul W.S. Anderson            7
148         Ridley Scott            6
950        Antoine Fuqua            6
..                   ...          ...
537         Stiles White            0
538        David MichÃ´d            0
539       Akiva Goldsman            0
540      Douglas McGrath            0
498  Christopher Spencer            0

[997 rows x 2 columns]

# 15. Фильмы с каким актером принесли самые высокие кассовые сборы в 2012 году?

In [20]:
answers['15'] = 'Chris Hemsworth'

In [201]:
# Сформируем список всех актёров, которые снимались в фильмах в 2012 году
casts = list(set(split_data_in_field(data[data['release_year'] == 2012]['cast'])))

# подготовим DataFrame с актёром и суммой кассовых сборов по фильмам
result = {
    'cast': casts, 
    'sum_profit': []
}

# для каждого актёра подсчитаем кассовые сборы по фильмам, в которых он снимался, в 2012 году
for cast in casts:
    result['sum_profit'].append(
        data[data['cast'].str.contains(cast)
             & (data['release_year'] == 2012)]
        ['profit'].sum()
    )
    
# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['sum_profit'], ascending=False))

                  cast  sum_profit
301    Chris Hemsworth  1542450773
127        Denis Leary  1319460639
196        Chris Evans  1299557910
8    Robert Downey Jr.  1299557910
62        Mark Ruffalo  1299557910
..                 ...         ...
443     Malin Ã…kerman   -43733509
84       Timothy Spall   -51893525
14        James Kidnie   -51893525
259      Heidi Hawkins   -51893525
41       Kirsten Dunst   -68109207

[466 rows x 2 columns]

# 16. Какой актер снялся в большем количестве высокобюджетных фильмов? Примечание: в фильмах, где бюджет выше среднего по данной выборке.

In [21]:
answers['16'] = 'Matt Damon'

In [208]:
# Сформируем список всех актёров, которые снимались в высокобюджетных фильмах
casts = list(set(split_data_in_field(data[data['budget'] > data['budget'].mean()]['cast'])))

# подготовим DataFrame с актёром и суммой кассовых сборов по фильмам
result = {
    'cast': casts, 
    'sum_profit': []
}
    
# для каждого актёра определим кол-во высокобюджетных фильмов в которых он снялся
for cast in casts:
    result['sum_profit'].append(
        data[data['cast'].str.contains(cast)
             & (data['budget'] > data['budget'].mean())]
        ['profit'].count()
    )

# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['sum_profit'], ascending=False))

                cast  sum_profit
569       Matt Damon          18
1482    Adam Sandler          17
1386  Angelina Jolie          16
254     Eddie Murphy          15
737       Tom Cruise          15
...              ...         ...
645    RenÃ©e Taylor           1
649      Jenna Stern           1
651    Dougray Scott           1
656   Garry Marshall           1
752     Julie Kavner           1

[1505 rows x 2 columns]

# 17. В фильмах какого жанра больше всего снимался Nicolas Cage?

In [22]:
answers['17'] = 'Action'

In [219]:
data[data['cast'].str.contains('Nicolas Cage')]['profit'].count()

27

In [222]:
# Сформируем список всех жанров, которые встречаются в DataFrame
genres = list(set(split_data_in_field(data['genres'])))

# подготовим DataFrame с жанром и кол-вом фильмов
result = {
    'genre': genres, 
    'movie_count': []
}

for genre in genres:
    result['movie_count'].append(
        data[
            data['cast'].str.contains('Nicolas Cage') &
            data['genres'].str.contains(genre)
            ]
        ['profit'].count()
    )
    
# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['movie_count'], ascending=False))

              genre  movie_count
8            Action           17
0          Thriller           15
15            Drama           12
2             Crime           10
16          Fantasy            8
17        Adventure            7
9            Comedy            6
7   Science Fiction            4
11           Family            3
4           Mystery            3
3         Animation            3
14          History            2
6            Horror            1
12          Romance            1
5               War            1
1             Music            0
10          Foreign            0
13          Western            0
18      Documentary            0

# 18. Самый убыточный фильм от Paramount Pictures

In [23]:
answers['18'] = 'K-19: The Widowmaker (tt0267626)'

In [348]:
data[data['production_companies'].str.contains('Paramount Pictures')][[
    'production_companies', 'original_title', 'profit'
]].sort_values(['profit'], ascending=True)

,production_companies,original_title,profit
925,Paramount Pictures|Intermedia Films|National G...,K-19: The Widowmaker,-64831034
1123,Paramount Pictures|Donners' Company|Mutual Fil...,Timeline,-60519261
1722,Paramount Pictures|Virtual Studios|Revolution ...,Next,-51788987
1623,Paramount Pictures|Patalex Productions,Alfie,-46604061
1631,Paramount Pictures|Kopelson Entertainment|Harl...,Twisted,-24805000
...,...,...,...
730,Paramount Pictures|Skydance Productions|Bad Ro...,Mission: Impossible - Ghost Protocol,549713380
1738,Paramount Pictures|DreamWorks SKG|Amblin Enter...,Transformers,559709780
603,Lucasfilm|Paramount Pictures,Indiana Jones and the Kingdom of the Crystal S...,601636033
317,Paramount Pictures|DreamWorks SKG|Amblin Enter...,Transformers: Revenge of the Fallen,686297228
828,Paramount Pictures|Di Bonaventura Pictures|Has...,Transformers: Dark of the Moon,928746996

# 19. Какой год стал самым успешным по суммарным кассовым сборам?

In [24]:
answers['19'] = '2015'

In [236]:
data.groupby(['release_year'])[['revenue']].sum().sort_values(['revenue'],ascending=False)

                  revenue
release_year
2015          25449202382
2014          23405862953
2013          23213799791
2012          23079001687
2011          22676791872
2010          21071204961
2009          20261791024
2008          18252781990
2007          18162406801
2004          15663430720
2005          15309425558
2006          14775042320
2003          14346123312
2002          14136361487
2001          13017764865
2000          10664099805

# 20. Какой самый прибыльный год для студии Warner Bros?

In [25]:
answers['20'] = '2014'

In [240]:
data[
    data['production_companies'].str.contains('Warner Bros')
    ].groupby(['release_year'])[['revenue']].sum().sort_values(['revenue'],ascending=False)

                 revenue
release_year
2014          3243064519
2007          3183675217
2008          3050595031
2010          3008712985
2011          2845393682
2003          2745493377
2009          2737954136
2004          2731933725
2013          2599953400
2005          2412980298
2001          2266545668
2012          1869520056
2002          1702709901
2015          1691168351
2006          1521170743
2000          1025531386

# 21. В каком месяце за все годы суммарно вышло больше всего фильмов?

In [26]:
answers['21'] = 'Сентябрь'

In [168]:
# добавим в данные столбик с месяцем релиза
data['release_month'] = data['release_date'].apply(lambda x: x.split('/')[0])

In [169]:
data.groupby(['release_month'])[['revenue']].count().sort_values(['revenue'],ascending=False)

               revenue
release_month
9                  227
12                 190
10                 186
8                  161
3                  156
4                  149
6                  147
11                 146
7                  142
5                  140
2                  135
1                  110

# 22. Сколько суммарно вышло фильмов летом? (за июнь, июль, август)

In [27]:
answers['22'] = '450'

In [170]:
data[
    data['release_month'].isin(list(['6','7','8']))
    ][['release_month','revenue']].count()

release_month    450
revenue          450
dtype: int64

# 23. Для какого режиссера зима – самое продуктивное время года?

In [185]:
answers['23'] = 'Peter Jackson'

In [184]:
# фильмы вышедшие зимой
winter_movies = data[data['release_month'].isin(list(['1','2','12']))]

# Сформируем список всех режиссеров, которы участвовали в съёмках зимних фильмов
directors = list(set(split_data_in_field(winter_movies['director'])))

winter_directors_list = []


for idx, row in winter_movies.iterrows():
    for director in row['director'].split('|'):
        winter_directors_list.append([director, 1])

winter_directors_df = pd.DataFrame(winter_directors_list,  columns=['director', 'movie_count'])
winter_directors_df.groupby(['director'])[['director','movie_count']].sum().sort_values(by=['movie_count'], ascending=False)

                   movie_count
director
Peter Jackson                7
Steven Soderbergh            6
Clint Eastwood               6
Shawn Levy                   4
Adam Shankman                4
...                        ...
John Luessenhop              1
John Musker                  1
John Polson                  1
Callan Brunker               1
Xavier Palud                 1

[358 rows x 1 columns]

In [340]:
# фильмы вышедшие зимой
winter_movies = data[data['release_month'].isin(list(['1','2','12']))]

# Сформируем список всех режиссеров, которы участвовали в съёмках зимних фильмов
directors = list(set(split_data_in_field(winter_movies['director'])))

# подготовим DataFrame с режиссером и кол-вом фильмов
result = {
    'director': directors, 
    'movie_count': []
}

# для каждого режиссера рассчитаем кол-во фильмов, которые вышли в зимние месяцы
for director in directors:
    result['movie_count'].append(
        data[
            data['director'].str.contains(director)
            ]
        ['profit'].count()
    )
    
# Сфрмируем результат в виде DataFrame
result = pd.DataFrame.from_dict(result)
display(result.sort_values(['movie_count'], ascending=False))

              director  movie_count
130                McG           13
94   Steven Soderbergh           13
55        Ridley Scott           12
110     Clint Eastwood           12
201     Peter Farrelly           10
..                 ...          ...
250      Griffin Dunne            1
137       David Moreau            1
246         Barry Cook            1
245     Angelina Jolie            1
357       BjÃ¶rn Stein            1

[358 rows x 2 columns]

# 24. Какая студия дает самые длинные названия своим фильмам по количеству символов?

In [164]:
answers['24'] = 'Four By Two Productions'

In [160]:
for idx, row in data.iterrows():
    length = len(row['original_title'])
    for companie in row['production_companies'].split('|'):
        companies_list.append([companie, length])
        
companies_df = pd.DataFrame(companies_list,  columns=['companie', 'length'])
companies_df.groupby(['companie'])[['companie','length']].mean().sort_values(by=['length'], ascending=False)

                                       length
companie
Midnight Picture Show                  267.25
Room 9 Entertainment                   256.75
Brookwell-McNamara Entertainment       242.25
Heineken Branded Entertainment         239.75
Lions Gate Family Entertainment        238.50
...                                       ...
Goldsmith-Thomas Productions            27.50
Phantom Four                            25.50
Night Chronicles                        23.00
Motion Picture Corporation of America   21.50
Empire Pictures                         20.75

[1771 rows x 1 columns]

# 25. Описание фильмов какой студии в среднем самые длинные по количеству слов?

In [163]:
answers['25'] = 'Midnight Picture Show'

In [161]:
for idx, row in data.iterrows():
    length = len(row['overview'])
    for companie in row['production_companies'].split('|'):
        companies_list.append([companie, length])
        
companies_df = pd.DataFrame(companies_list,  columns=['companie', 'length'])
companies_df.groupby(['companie'])[['companie','length']].mean().sort_values(by=['length'], ascending=False)

                                       length
companie
Midnight Picture Show                   413.8
Room 9 Entertainment                    398.2
Brookwell-McNamara Entertainment        381.0
Lions Gate Family Entertainment         372.6
Crest Animation Productions             372.6
...                                       ...
Henceforth                               39.2
Phantom Four                             34.8
Night Chronicles                         33.8
Motion Picture Corporation of America    29.0
Empire Pictures                          29.0

[1771 rows x 1 columns]

# 26. Какие фильмы входят в 1 процент лучших по рейтингу? 
по vote_average

In [31]:
answers['26'] = 'Inside Out, The Dark Knight, 12 Years a Slave'

In [372]:
# вычислим 1% от общего числа фильмов
best_count = int(round(data[['original_title']].count() * 0.01))
display(best_count)
# отсортируем выборку по рейтингу и возьмем 1% от результата
data[['original_title', 
      'vote_average']].sort_values(['vote_average'], ascending=False).head(best_count)

19

                                     original_title  vote_average
599                                 The Dark Knight           8.1
118                                    Interstellar           8.0
125                              The Imitation Game           8.0
9                                        Inside Out           8.0
34                                             Room           8.0
1183                        The Wolf of Wall Street           7.9
128                                       Gone Girl           7.9
1191                               12 Years a Slave           7.9
119                         Guardians of the Galaxy           7.9
1081  The Lord of the Rings: The Return of the King           7.9
1800                                        Memento           7.9
370                                       Inception           7.9
872                                     The Pianist           7.9
138                        The Grand Budapest Hotel           7.9
1188                                            Her           7.8
28                                        Spotlight           7.8
124                                      Big Hero 6           7.8
177                          The Fault in Our Stars           7.8
863           The Lord of the Rings: The Two Towers           7.8

# 27. Какие актеры чаще всего снимаются в одном фильме вместе?

In [119]:
answers['27'] = 'Daniel Radcliffe & Rupert Grint'

In [114]:
def split_acters_in_field(field):
    """
    Функция разбивает строку на части, и возвращает список со всеми возможными парами актёров
    """
    result = []
    actors = list(set(field.split('|')))
    
#   собираем все возможные пары из списка актёров
    for idx, first in enumerate(actors):
        for second in actors[idx + 1:]:
            result.append(first + '|' + second)
#   возвращаем список пар актёров в виде актёр1|актёр2 
    return result

def calc_pairs_count(pairs_list, pairs_dict):
    """
    Функция суммирует количество повторений пар актёров
    """
    for pair in pairs_list:
        pairs_dict[pair] += 1
    return pairs_dict

In [118]:
# выберем фильмы в которых более одного актёра
data['cast_count'] = data['cast'].apply(lambda x: len(str(x).split('|')))
casts = data[data['cast_count'] > 1]['cast']

# выделим пары актёров которые встречаются в каждом фильме
pairs = []
pairs_dict = dict()
for field in casts:
    pairs.extend(split_acters_in_field(field))

# заполнить список-заглушку для кол-ва совпадений пар актёров в фильмах
for el in pairs:
    pairs_dict[el] = 0
    
for field in casts:
    pairs_dict = calc_pairs_count(split_acters_in_field(field), pairs_dict)

pairs_df = pd.DataFrame(data = {'pair': pairs_dict.keys(), 'count': pairs_dict.values()})    
pairs_df.sort_values(by=['count'], ascending=False)

                                   pair  count
2397      Daniel Radcliffe|Rupert Grint      8
2398       Daniel Radcliffe|Emma Watson      8
2404           Rupert Grint|Emma Watson      8
1294            Ben Stiller|Owen Wilson      6
3684   Helena Bonham Carter|Johnny Depp      6
...                                 ...    ...
6248             Jason Segel|Mila Kunis      1
6249           Mila Kunis|Russell Brand      1
6250           Hugh Jackman|Bryan Brown      1
6251         Hugh Jackman|Nicole Kidman      1
17952          Nathan Bexton|Susan Ward      1

[17953 rows x 2 columns]

# Submission

In [186]:
# в конце можно посмотреть свои ответы к каждому вопросу
answers

{'1': 'Pirates of the Caribbean: On Stranger Tides (tt1298650)',
 '2': 'Gods and Generals (tt0279111)',
 '3': 'Winnie the Pooh (tt1449283)',
 '4': '110',
 '5': '107',
 '6': 'Avatar (tt0499549)',
 '7': 'The Lone Ranger (tt1210819)',
 '8': '1478',
 '9': 'The Dark Knight (tt0468569)',
 '10': 'The Lone Ranger (tt1210819)',
 '11': 'Drama',
 '12': 'Action',
 '13': 'Peter Jackson',
 '14': 'Robert Rodriguez',
 '15': 'Chris Hemsworth',
 '16': 'Matt Damon',
 '17': 'Action',
 '18': 'K-19: The Widowmaker (tt0267626)',
 '19': '2015',
 '20': '2014',
 '21': 'Сентябрь',
 '22': '450',
 '23': 'Peter Jackson',
 '24': 'Four By Two Productions',
 '25': 'Midnight Picture Show',
 '26': 'Inside Out, The Dark Knight, 12 Years a Slave',
 '27': 'Daniel Radcliffe & Rupert Grint'}

In [121]:
# и убедиться что ни чего не пропустил)
len(answers)

27